{
    "webDeveloper": {
        "title": "Web Developer",
        "details": {
            "tab2": {
                "Primary Languages": [
                    "TypeScript",
                    "JavaScript",
                    "SASS",
                    "PHP",
                    "English",
                    "Japanese"
                ],
                "Other Languages": [
                    "C#",
                    "PowerShell",
                    "SQL",
                    "VBA",
                    "Python"
                ],
                "Primary Frameworks": [
                    "React",
                    "Vue",
                    "Node.js",
                    "ArcGIS API for JavaScript",
                    "ArcGIS Experience Builder",
                    "WordPress",
                    "Laravel",
                    "Bootstrap",
                    "TailwindCSS"
                ],
                "Databases": [
                    "MySQL",
                    "MariaDB",
                    "PostgreSQL",
                    "Microsoft SQL Server",
                    "MongoDB",
                    "SQLite"
                ],
                "Primary Tools": [
                    "Git",
                    "Husky",
                    "Webpack",
                    "Babel",
                    "Vite",
                    "Vitest",
                    "Jira",
                    "VSCode",
                    "Visual Studio",
                    "Pycharm Pro",
                    "IIS",
                    "Windows",
                    "MacOS",
                    "Linux"
                ]
            },
            "tab1": {
                "virtues": [
                    "Always hungry to learn -- whether a new library, a new framework, programming paradigm, or an entirely new language, bring it.",
                    "Start with the user and work backwards -- plot out their workflow and what they need to accomplish, then draft the data structures needed, the best way to manage them, and implement the foundations first.",
                    "Rapid prototyping -- start fast, fail early, refactor often. Early ideas are starting points only, and I never want to be locked into them.",
                    "Every library, every framework, every paradigm, every language has its place. I'm not a purist, and I'm not a zealot. I'm a pragmatist, and I'm a realist. I'll use the right tool for the job, and I'll use it well.",
                    "Document, document, document -- in commit messages, in Architectural Decision Records, in comments in the code when necessary. If people know why a decision was made, it becomes far easier to optimize it.",
                    "As a wise company mascot told me, \"You should always axolotl questions.\" I'm committed to humbleness, and not being afraid to ask dumb questions. Likewise, I'm committing to answering questions no matter how dumb, because I know the feeling of being afraid to ask them.",
                ],
                "roles": [
                    "Digital Project Coordinator, Cato Institute",
                    "Geospatial Developer, Axim Geospatial",
                    "Web Developer, CRAFT|DC",
                    "Web Developer, Vox Global"
                ]
            }
        }
    },
    "projectManager": {
        "title": "Project Manager",
        "details": {
            "tab1": {
                "virtues": [
                    "Experience leading corporate initiatives and chairing stakeholder conferences",
                    "Proactive, agile communication between all parties -- as long as we're on the same page, nothing is impossible",
                    "Ensure all voice their views -- as someone with social anxiety, I understand how difficult it may be to stand up and speak, so I go out of my way to get everyone's input, and ",
                    "As a project lead, my team doesn't work for me -- I work for the team"
                ],
                "roles": [
                    "Digital Project Coordinator, Cato Institute",
                    "Workflow Implementation Lead, Cato Institute"
                ]
            },
            "tab2": {
                "Paradigms": [
                    "Agile",
                    "Scrum",
                    "Leaders Who Serve Their Teams",
                ],
                "Primary Tools": [
                    "Jira",
                    "Wrike",
                    "GitHub Issues",
                    "GitLab Issues"
                ]
            }
        }
    },
    "communicator": {
        "title": "Writer & Communicator",
        "details": {
            "tab1": {
                "virtues": [
                    "Always approach the writing from the audience's perspective: What assumptions do they have? What level of everyday technical knowledge do they have? Thus, I can anticipate what things may confuse and expand on those in detail.",
                    "Use lots of visual cues in technical documentation -- Not everyone processes written spatial directions the same, and from my own experience I know we all have our own unique imaginations. Thus, whenever possible I always use screenshots with arrows and callouts so everyone knows exactly what to use.",
                    "Communication skills honed by years of providing free remote IT support to my self-described \"digital Amish\" mother.",
                    "Additional experience in communication ideas to the public."
                ],
                "roles": [
                    "Geospatial Developer, Axim Geospatial (writing technical documentation)",
                    "Digital Project Coordinator, Cato Institute (when writing technical documentation)",
                    "Web Developer, CRAFT|DC (when writing technical documentation)",
                    "Contract Writer, Politemps",
                    "Social Media Associate, Competitive Enterprise Institute"
                ]
            },
            "tab2": {
                "Primary Languages": [
                    "English",
                    "Japanese",
                    "Guy"
                ],
                "Primary Tools": [
                    "Microsoft Word",
                    "LibreOffice Writer",
                    "Google Docs",
                    "Mailchimp",
                    "Constant Contact",
                    "Hubspot"
                ]
            }
        }
    }
}